Tekla.Structures.Model.Operations.Operation.ShapeMetadataResult
The result type of the shape metadata operations. If you alter this, check if
you need to change ShapeMetadataResult_e on the Tekla Structures core side

Tekla.Structures.Model.Operations.Operation.ShapeMetadataResult.NoResult
Operation failed.

Tekla.Structures.Model.Operations.Operation.ShapeMetadataResult.OK
Operation succeeded.

Tekla.Structures.Model.Operations.Operation.ShapeMetadataResult.DuplicateKeyExist
At least one identical pre-existing key was found in the shape when trying to insert key and value

Tekla.Structures.Model.Operations.Operation.ShapeMetadataResult.NoMatchingShape
No matching shape found for the GUID in the catalog

Tekla.Structures.Model.Operations.Operation.ShapeMetadataResult.NoMatchingKey
No matching key found for the GUID in the shape